// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1.
// Выполнить с помощью рекурсии.
//N = 5 -> "5, 4, 3, 2, 1"
//N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

/*
Console.WriteLine("enter N: ");
int N = int.Parse(Console.ReadLine());

void FindNumber (int a)
{
 if (a == 1) {System.Console.WriteLine(a); return;}   
FindNumber (a-1);
System.Console.WriteLine(a);
}

FindNumber(N);


/*
Console.WriteLine("enter n: ");
int n = int.Parse(Console.ReadLine());
Console.WriteLine("enter m: ");
int m = int.Parse(Console.ReadLine());


void FindNumber (int a, int b)
{
 else 
 if (a == b) {System.Console.WriteLine(a); return;}   
FindNumber (a, b-1);
System.Console.WriteLine(b);
}